Msprg/Proxmark5_BWM_esp32/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c2"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_SAVE_RESTORE_LIBCALLS=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=5
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=512
CONFIG_BT_NIMBLE_LOG_LEVEL_NONE=y
CONFIG_BT_RELEASE_IRAM=y
CONFIG_ESP_TLS_PSK_VERIFICATION=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_ESP_EVENT_POST_FROM_ISR=n
CONFIG_XTAL_FREQ_26=y
CONFIG_ESP_SYSTEM_PMP_IDRAM_SPLIT=n
CONFIG_ESP_TIMER_TASK_STACK_SIZE=2048
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=5
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1160
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_HAL_ASSERTION_DISABLE=y
CONFIG_LWIP_SO_LINGER=y
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=4096
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=2048
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_SPI_FLASH_AUTO_SUSPEND=y

# --- Idle power ---------------------------------------------------------------
# WARN by default: INFO on the console UART cost a vsnprintf per event and, with
# log forwarding on, a second one for the host. The max stays at INFO so the host
# can raise it at runtime with APP_CMD_SET_LOG_LEVEL when it wants the detail.
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
# Dynamic frequency scaling: 120 MHz only while something holds a lock, else the
# 26 MHz crystal. The command UART runs off the fixed PLL_F40M branch so its baud
# does not move. Light sleep (tickless idle) is deliberately NOT enabled: the host
# sends frames unsolicited and the UART cannot wake the chip without losing them.
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
# Without this the BLE controller holds the max-frequency lock for as long as it
# is enabled (always), which would make DFS a no-op. With it the controller drops
# the lock and powers the BT PHY down between advertising / connection events.
# LP clock is the main crystal (default): the module has no 32.768 kHz crystal.
CONFIG_BT_LE_SLEEP_ENABLE=y
